alpha-blog/app/controllers/articles_controller.rb

  def index
    @articles = Article.paginate(page: params[:page], per_page: 5)
---
SELECT COUNT(*) FROM `articles`
SELECT `articles`.* FROM `articles` LIMIT 5 OFFSET 0

  def create
    @article = Article.new(article_params)
    @article.user = current_user
    if @article.save
---
INSERT INTO `articles` (`title`, `description`, `created_at`, `user_id`) VALUES ('delete article', 'delete description', '2022-09-10 00:22:55', 23)

  def update
    if @article.update(article_params)
---
UPDATE `articles` SET `articles`.`description` = 'edited - description of first article' WHERE `articles`.`id` = 1