alpha-blog/app/controllers/users_controller.rb

SELECT COUNT(*) FROM `articles` WHERE `articles`.`user_id` = 1
SELECT `articles`.* FROM `articles` WHERE `articles`.`user_id` = 1 LIMIT 5 OFFSET 0
---
  def show
    @articles = @user.articles.paginate(page: params[:page], per_page: 5)

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 5 OFFSET 0
---
  def index
    # @users = User.all
    @users = User.paginate(page: params[:page], per_page: 5)

UPDATE `users` SET `users`.`email` = 'janedoe@example.com', `users`.`updated_at` = '2022-09-02 00:37:54.902690', `users`.`password_digest` = '$2a$12$vNa2pvetpOS0uPhizvq5I.MZ0pWi2CIRjH2uMdhFw9dLYosF9aOuu' WHERE `users`.`id` = 2
---
  def update
    if @user.update(user_params)

INSERT INTO `users` (`username`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('max', 'max@example.com', '2022-09-04 02:42:49.031008', '2022-09-04 02:42:49.031008', '$2a$12$rfVePSOD0h4lqsJzNHxuEOpSt9G.VeD.rfqqOr8MV.G4vHL51AjKa')
---
  def create
    @user = User.new(user_params)
    if @user.save